Autodesk.Revit.DB.Ceiling.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of ceiling within the project.
Remarks:
To validate curve loop profile use Autodesk.Revit.DB.BoundaryValidation.
document:
The document in which the new ceiling is created.
curveLoops:
An array of planar curve loops that represent the profile of the ceiling.
ceilingTypeId:
Id of the ceiling type to be used by the new ceiling. If InvalidElementId is passed, the default type will be used.
levelId:
Id of the level on which the ceiling is to be placed.
Returns:
If successful a new ceiling object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId levelId is not a Level.
-or-
The ElementId ceilingTypeId does not correspond to a CeilingType.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.Ceiling.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Line,System.Double)
Creates a new instance of ceiling within the project.
Remarks:
To validate curve loop profile use Autodesk.Revit.DB.BoundaryValidation.
document:
The document in which the new ceiling is created.
curveLoops:
An array of planar curve loops that represent the profile of the ceiling.
ceilingTypeId:
Id of the ceiling type to be used by the new ceiling. If InvalidElementId is passed, the default type will be used.
levelId:
Id of the level on which the ceiling is to be placed.
slopeArrow:
A line used to control the slope angle of the Ceiling. It must be horizontal.
slope:
The slope angle.
Returns:
If successful a new ceiling object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId levelId is not a Level.
-or-
The ElementId ceilingTypeId does not correspond to a CeilingType.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
The slopeArrow must be a horizontal line.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.Ceiling.SketchId
Returns id of the sketch.
Since:
2022